monitoring/load-tests/artillery-config.yml
config:
  target: "http://localhost:8000"
  phases:
    - duration: 60
      arrivalRate: 10
      name: "Warm up"
    - duration: 120
      arrivalRate: 50
      name: "Sustained load"
    - duration: 60
      arrivalRate: 100
      name: "Peak load"
  defaults:
    headers:
      Content-Type: "application/json"

scenarios:
  - name: "Ticket Management Flow"
    weight: 60
    flow:
      - get:
          url: "/api/tickets"
          capture:
            - json: "$[0].id"
              as: "ticketId"
      - think: 2
      - get:
          url: "/api/tickets/{{ ticketId }}"
      - think: 3
      - post:
          url: "/api/tickets"
          json:
            title: "Load Test Ticket {{ $randomString() }}"
            description: "Testing system performance"
            priority: "medium"
            status: "open"

  - name: "User Authentication"
    weight: 20
    flow:
      - post:
          url: "/api/auth/login"
          json:
            username: "testuser"
            password: "testpass123"
          capture:
            - json: "$.token"
              as: "authToken"
      - get:
          url: "/api/users/me"
          headers:
            Authorization: "Bearer {{ authToken }}"

  - name: "Search and Filter"
    weight: 20
    flow:
      - get:
          url: "/api/tickets?status=open"
      - think: 1
      - get:
          url: "/api/tickets?priority=high"
      - think: 1
      - get:
          url: "/api/tickets?search=bug"